[{"id": 0, "authors": "JOANA PEREIRA REPINALDO", "year": 2015, "title": "CONTROLE DE VELOCIDADE DE UM SERVOMOTOR UTILIZANDO SOFTWARE LABVIEW REAL-TIME", "keywords": "Instrumentação; Sistema de Controle; LabVIEW; Controle em Tempo Real", "link": "https://youtube.com", "abstract": "Este trabalho apresenta uma ferramenta didática para sistemas de controle que\npossibilita a associação entre os conceitos teóricos e práticos. Facilita o aprendizado\nao proporcionar o desenvolvimento de experiências de laboratório. É possível aplicar\ntécnicas de controle clássico como de controladores PID (Proporcional, Integral e\nDerivativo) permitindo ao usuário controlar a velocidade do servomotor. A entrada do\nsistema pode ser definida como uma forma de onda: quadrada, triangular ou senoidal.\nO controle do servomotor é realizado através de uma placa de aquisição de dados e\ndo software LabVIEW, o qual possui uma interface gráfica amigável facilitando o\nmanuseio do aluno. O sistema utiliza a técnica hardware-in-the-loop em tempo real e\né capaz de armazenar os dados para análises qualitativas e quantitativas off-line."}, {"id": 1, "authors": "LUCAS MENDES RIBEIRO ARBIZA", "year": 2016, "title": "SDN no Contexto de IoT: Refatoração de Middleware para Monitoramento de Pacientes Crônicos Baseada em Software-Defined Networking", "keywords": "Software-defined networking; internet of things; gerência de redes; middleware; redes domésticas", "link": "https://google.com", "abstract": "Algumas palavras e definições comumente utilizadas quando se está falando de Software-Defined\nNetworking, como programabilidade, flexibilidade, ou gerenciamento centralizado, parecem\nmuito apropriadas ao contexto de um outro paradigma de rede: Internet of Things. Em redes\ndomésticas já não é incomum a existência de dispositivos projetados para segurança, climatização, iluminação, monitoramento de saúde e algumas formas de automação que diferem entre\nsi em diversos aspectos, como no modo de operar e de se comunicar. Lidar com este tipo de\ncenário, que pode diferir bastante daquilo que estamos acostumados na gerência de redes e serviços, fazendo uso dos recursos tradicionais como ferramentas e protocolos bem estabelecidos,\npode ser difícil e, em alguns casos, inviável. Com o objetivo de possibilitar o monitoramento\nremoto de pacientes com doenças crônicas através de dispositivos de healthcare disponíveis\nno mercado, uma proposta de middleware foi desenvolvida em um projeto de pesquisa para\ncontornar as limitações relacionadas à interoperabilidade, coleta de dados, gerência, segurança\ne privacidade encontradas nos dispositivos utilizados. O middleware foi projetado com o intuito de executar em access points instalados na casa dos pacientes. Contudo, as limitações de\nhardware e software do access point utilizado refletem no desenvolvimento, pois restringem\no uso de linguagens de programação e recursos que poderiam agilizar e facilitar a implementação dos módulos e dos mecanismos necessários. Os contratempos encontrados no desenvolvimento motivaram a busca por alternativas, o que resultou na refatoração do middleware\natravés de Software-Defined Networking, baseando-se em trabalhos que exploram o uso desse\nparadigma em redes domésticas. O objetivo deste trabalho é verificar a viabilidade da utilização de Software-Defined Networking no contexto de Internet of Things, mais especificamente,\naplicado ao serviço de monitoramento de pacientes da proposta anterior e explorar os possíveis benefícios resultantes. Com a refatoração, a maior parte da carga de serviços da rede e do\nmonitoramento foi distribuída entre servidores remotos dedicados, com isso os desenvolvedores\npodem ir além das restrições do access point e fazer uso de recursos antes não disponíveis, o que\npotencializa um processo de desenvolvimento mais ágil e com funcionalidades mais complexas, ampliando as possibilidades do serviço. Adicionalmente, a utilização de Software-Defined\nNetworking proporcionou a entrega de mais de um serviço através de um único access point,\nescalabilidade e autonomia no gerenciamento das redes e dos dispositivos e na implantação de\nserviços, fazendo uso de recursos do protocolo OpenFlow, e a cooperação entre dispositivos e\nserviços a fim de se criar uma representação digital mais ampla do ambiente monitorado."}, {"id": 2, "authors": "Jetro Turan Salvador, Tereza Cristina Carvalho, Luiz Antonio Corrêa Lucchesi", "year": 2011, "title": "Relações cálcio e magnésio presentes no solo e teores foliares de macronutrientes", "keywords": "Glycine max (L.) Merrill; Nutrients; Leave", "link": "https://periodicos.pucpr.br/cienciaanimal/article/view/11060/10445", "abstract": "A disponibilidade de nutrientes no solo é dependente de uma série de fatores.\nPor causa das diferentes inte-rações que ocorrem, o uso e monitoramento das relações entre nutrientes no solo pode ser uma das formas adequadas\npara proporcionar um equilíbrio nutricional para as plantas.\nO objetivo deste trabalho foi avaliar se a aplicação de diferentes relações cálcio e magnésio no solo alteram\nos teores de cálcio, magnésio, fósforo e potássio em plantas de soja.\nO trabalho foi conduzido em delineamento inteiramente casualizado, em casa de vegetação, utilizando terra oriunda de um latossolo\nsubmetido a sete diferentes relações de cálcio e magnésio (1:0, 10:1, 3:1, 1:1, 1:3, 1:10 e 0:1) e o\ntratamento testemunha, sendo utilizadas três repetições por tratamento.\nRealizou-se o cultivo de duas plantas de soja por vaso, sendo estas, aos 75 dias após a se-meadura,\nsubmetidas a análises foliares quanto aos teores de cálcio, magnésio, fósforo e potássio.\nOcorreram alterações significativas nos teores trocáveis de cálcio e magnésio do solo e nos teores foliares de cálcio,\nmagnésio e potássio, quando se usaram diferentes relações de cálcio e magnésio no solo"}, {"id": 3, "authors": "Jacob Biamonte, Peter Wittek, Nicola Pancotti, Patrick Rebentrost, Nathan Wiebe & Seth Lloyd", "year": 2017, "title": "Quantum machine learning", "keywords": "", "link": "https://www.nature.com/articles/nature23474", "abstract": "Fuelled by increasing computer power and algorithmic advances, machine learning techniques have become powerful\ntools for finding patterns in data. Quantum systems produce atypical patterns that classical systems are thought not\nto produce efficiently, so it is reasonable to postulate that quantum computers may outperform classical computers on\nmachine learning tasks. The field of quantum machine learning explores how to devise and implement quantum software\nthat could enable machine learning that is faster than that of classical computers. Recent work has produced quantum\nalgorithms that could act as the building blocks of machine learning programs, but the hardware and software challenges\nare still considerable."}]